% 列主元素高斯消去法
clear;close all;format long;clc;

% A=[10,-1,-2;-1,10,-2;-1,-1,5];
% b=[72,83,42]';

% A=[ 28,-3,0,0,0;
%     -3,38,-10,0,-5;
%     -10,0,25,-15,0;
%     0,0,-15,45,0;
%     0,-5,0,0,30];
% b=[10,0,0,0,0]';

% A=[-4 1 1 1
%     1 -4 1 1
%     1 1 -4 1
%     1 1 1 -4];
% b=[1 1 1 1]';

A=[0 1 1 1
   1 0 1 1
   1 1 0 1
   1 1 1 0];   % 此方程组难以使用迭代法求解，可以用高斯消去法进行求解
b=[87.4 101.6 99.2 115.7]';

N=length(b);
fprintf('MATLAB内部函数的计算结果：');
x=A\b      %库函数计算结果

A(:,N+1)=b;
[m,n] = size(A);
i = 1;
j = 1;
while (i <= m) && (j <= n)
    [p,k] = max(abs(A(i:m,j)));
    k = k+i-1;
    A([i k],j:n) = A([k i],j:n);
    A(i,j:n) = A(i,j:n)/A(i,j);
    for k = [1:i-1 i+1:m]
        A(k,j:n) = A(k,j:n) - A(k,j)*A(i,j:n);
    end
    i = i + 1;
    j = j + 1;
end

fprintf('本程序的计算结果：');
x=A(:,N+1)

